<?php
/**
 * Created by PhpStorm.
 * User: huan
 * Date: 2020/8/20
 * Time: 13:24
 */

  /** 6-1 ： 进度管理计划
   * 规划进度管理：
   *     操作次数： 1次
   *
   *  itto:
   *    输入：
   *        项目章程 (以项目章程的总里程碑为出发点和目标)
   *        项目管理计划
   *                     范围管理计划
   *                     开发方法
   *        事业环境因素
   *        组织过程资产
   *
   *     工具与技术：
   *        专家判断
   *        数据分析：包括不限于备选方案分析
   *        会议
   *
   *     输出：
   *        进度管理计划： 进度管理计划是项目管理计划的组成部分，可以是正式的也可以是
   *                非正式的，非常详细或者高度概括的。其中应包括合适的控制临界值
   *
   *
   *
   *
   *   6-2 ： 定义活动
   *        基本概念 ： 定义活动是识别和记录为完成项目可交付成果而须采取的具体行动过程
   *
   *        作用 ： 本过程的主要作用是将工作包分解为进度活动，作为对项目工作进行估算
   *            规划，执行，监督和控制的基础
   *
   *        操作次数 ： 本过程需要在整个项目期间开展
   *
   *        itto:
   *            输入：
   *                项目管理计划
   *                    进度管理计划
   *                    范围基准
   *                事业环境因素
   *                组织过程资产
   *
   *            工具与技术：
   *                专家判断
   *                分解: 把项目范围和项目可交付成果逐步划分为更小，更便于管理的组成部分的技术
   *                      一个是wbs分解 一个是活动分解
   *                滚动式规划 ： 渐进明细性
   *                会议
   *
   *            输出：
   *                活动清单： 就是吧wbs工作包分解成一个一个的清单。
   *                         活动清单包含项目所需要的进度活动，对于使用滚动式规划
   *                         或者敏捷技术的项目，活动清单会在项目进展过程中得到定期更新
   *                         活动清单包括每个活动的标识和工作范围，使项目团队成员知道需要
   *                         完成什么工作
   *
   *                活动属性：活动属性是指每项活动所具有的多重属性
   *
   *                里程碑清单：
   *
   *                变更请求：
   *
   *                项目管理计划更新
   *                    进度基准 ：如果变更控制请求经过同意了，那么必然会改变项目的进度基准
   *
   *                    成本基准 ：同上
   *
   *
   *    6-3：排列活动顺序
   *        基本概念：
   *            定义 ： 排列活动顺序就是识别和记录项目活动之间的关系的过程
   *
   *            作用 :  定义工作之间的逻辑顺序，以便于在既定的所有项目制约因素下获得最高的效率
   *
   *            操作次数 ： 整个项目期间开展
   *
   *            itto :
   *                输入：
   *                   项目管理计划 ： 进度管理计划，范围基准
   *
   *                   项目文件：活动属性，活动清单，假设日志， 里程碑清单
   *
   *                   事业环境因素：
   *
   *                   组织过程资产
   *
   *                工具与技术：
   *                    紧前关系图法
   *                    确定和整合依赖关系
   *                    提前量和滞后量
   *                    项目信息管理系统
   *
   *                输出：
   *                    项目进度网络图:
   *                            项目进度网络图表示
   *                            带有多个紧前活动的代表路径汇聚，
   *                            而带有多个紧后活动的则代表路径分支。
   *                    项目文件更新
   *                            活动属性
   *                            活动清单
   *                            假设日志
   *                            里程碑清单
   *
   *    6-4： 估算活动的持续时间
   *
   *       基本概念：
   *            定义：估算活动持续时间是根据资源的结果，估算完成单项活动所需工作
   *                时段数的过程
   *
   *
   *            作用： 本过程的主要作用是，确定完成每个活动所需花费的时间量
   *
   *            操作次数： 本过程需要在整个项目期间展开
   *
   *            渐进明细： 对持续事件的估算也应该渐进明细，取决于输入数据的数量和质量。
   *                    例如： 对工程与设计项目中，随着数据越来越详细越来越准确，
   *                        持续时间估算的准确性和质量也会越来越高
   *
   *            收益递减规律： 边际报酬并不是一开始就是减少的，而是先增加到一个最大值
   *                然后才进行减少的
   *
   *            资源数量 ： 增加资源数量，使其达到初始数量的两倍不一定能缩短一般的时间，
   *                因为这样做可能会因为风险而造成持续时间的增加，在某些情况下，如果增加
   *                太多的活动资源，可能会因为只是传递，学习曲线，额外合作等其他相关
   *                因素而造成持续时间的增加
   *
   *            技术进步 ： 在确定持续时间估算时，因为这个因素也可能发挥重要作用，例如：
   *                   通过采购最新的技术，制造工厂可以提高质量，而这可能会影响持续时间
   *                    和资源需求
   *
   *            员工激励 ： 项目经历还需要了解学生综合征和帕金森定律，前者指出人们只有在
   *                最后一刻，即快到期限时间才会全力以赴，后者指出，只要还有时间，工作就会不断扩展
   *                直到用完所有时间
   *
   *
   *
   *    ITTO:
   *        估算活动事件的输入：
   *         输入：
   *            项目管理计划：
   *                进度管理计划
   *                范围基准
   *
   *            项目文件:
   *                活动清单
   *                活动属性
   *                假设日志
   *                经验教训登记册
   *                里程碑清单
   *                项目团队派工单
   *                资源分解结构
   *                资源日历
   *                资源需求
   *                风险登记册
   *            事业环境因素
   *            组织过程资产：
   *                关于持续时间的历史信息
   *                项目日历
   *                估算政策
   *                进度规划方法论
   *                经验教训知识库
   *
   *        工具与技术：
   *            参数估算： 是一种基于历史数据和项目参数，使用某种算法来计算
   *            成本或持续时间的估算技术
   *
   *            类比估算： 类比估算是使用相似活动或项目的历史数据。来估算当前
   *             活动或项目的持续时间或成本的技术。
   *
   *            三点估算： 最可能时间， 最客观时间， 最悲观时间
   *                    计算公式： (t1+t2+t3)/3
   *
   *            专家判断
   *
   *            自下而上估算：
   *                    通过从下到上逐层汇总wbs组成部分的估算而得到项目估算。
   *
   *            数据分析：
   *                   备选方案分析：
   *                        多种方案多种可能分析
   *                   应急储备：
   *                        应急储备是包含在进度基准中的一段持续时间
   *                        项目经理控制应急储备
   *                   管理储备：
   *                        对付未知的风险，项目经理是没有权限对管理储备使用的
   *                        依据合同条款使用管理储备可能变更进度基准
   *
   *            决策： 适用于本过程的决策技术包括(不限于)投票。举手表决是从
   *            投票方法衍生出来的一种形式，经常用于敏捷项目中。举拳头表示不支持
   *            伸出五个手指表示完全支持，伸出三个手指以下的成员有机会提反对意见。
   *            进行不断的举手表决直到完全同意
   *
   *            会议： 通过会议讨论的方式
   *
   *
   *            活动持续时间估算的输出：
   *                持续时间估算
   *                估算依据
   *                项目文件的更新
   *
   *
   *        制定进度计划：
   *            定义： 指定进度计划是分析活动顺序，持续时间，资源需求和进度制约因素，
   *                创建进度模型，从而落实项目执行和监控的过程
   *            作用： 本过程的主要作用是，为完成项目活动而指定有计划日志进度的模型
   *            操作次数： 本过程需要在整个项目期间展开
   *            
   *
   *
   *
   */